MicheleTesser/stm32h5_template_drivers/adc.cpp
#include <algorithm>
#include <optional>

#include "adc.hpp"

#include "mapping.hpp"
#include "stm_common.hpp"
#include "stm32h5xx_hal_adc_ex.h"
#include "stm32h5xx_hal_dma_ex.h"
#include "stm32h5xx_hal_tim.h"
#include "stm32h5xx_hal_tim_ex.h"

using namespace ru::driver;

namespace ru::driver {
namespace {
constexpr uint32_t DMA_FIXED_WINDOW_READY = 0x80000000UL;
constexpr uint32_t DMA_SAMPLE_COUNT_MASK = ~DMA_FIXED_WINDOW_READY;

constexpr std::size_t dma_transfer_length(
    const stm32h5xx::cfg::adc_config& config) noexcept {
  return config.dma_frame_count == 0U ? 1U : config.dma_frame_count;
}

template <const stm32h5xx::cfg::adc_config* Config>
uint16_t* dma_buffer_data() noexcept {
  if constexpr (Config->uses_dma) {
    static uint16_t buffer[dma_transfer_length(*Config)]{};
    return buffer;
  }

  return nullptr;
}

template <const stm32h5xx::cfg::adc_config* Config>
constexpr std::size_t dma_buffer_size() noexcept {
  if constexpr (Config->uses_dma) {
    return dma_transfer_length(*Config);
  }

  return 0U;
}

constexpr const stm32h5xx::cfg::adc_config* config_for(const AdcId id) noexcept {
  switch (id) {
#define RU_STM32H5XX_ADC_CONFIG(name, config) \
    case AdcId::name:                         \
      return &config;
    RU_STM32H5XX_ADC_MAP(RU_STM32H5XX_ADC_CONFIG)
#undef RU_STM32H5XX_ADC_CONFIG
    default:
      return nullptr;
  }
}

uint16_t* dma_buffer_for(
    const stm32h5xx::cfg::adc_config* const p_config) noexcept {
#define RU_STM32H5XX_ADC_BUFFER_DATA(name, config) \
  if (p_config == &config) {                       \
    return dma_buffer_data<&config>();             \
  }
  RU_STM32H5XX_ADC_MAP(RU_STM32H5XX_ADC_BUFFER_DATA)
#undef RU_STM32H5XX_ADC_BUFFER_DATA
  return nullptr;
}

std::size_t dma_buffer_size_for(
    const stm32h5xx::cfg::adc_config* const p_config) noexcept {
#define RU_STM32H5XX_ADC_BUFFER_SIZE(name, config) \
  if (p_config == &config) {                       \
    return dma_buffer_size<&config>();             \
  }
  RU_STM32H5XX_ADC_MAP(RU_STM32H5XX_ADC_BUFFER_SIZE)
#undef RU_STM32H5XX_ADC_BUFFER_SIZE
  return 0U;
}

opaque_adc make_opaque(const stm32h5xx::cfg::adc_config* const p_config) noexcept {
  return opaque_adc{p_config};
}

uint32_t timer_prescaler(const TIM_TypeDef* instance,
                         const uint32_t counter_clock_hz) noexcept {
  const auto timer_clock_hz = timer_input_clock_hz(instance);
  const auto target_counter_clock_hz = counter_clock_hz == 0U ? 1U : counter_clock_hz;
  return timer_clock_hz > target_counter_clock_hz
             ? (timer_clock_hz / target_counter_clock_hz) - 1U
             : 0U;
}

uint32_t timer_period(const uint32_t counter_clock_hz,
                      const uint32_t frequency_hz) noexcept {
  const auto target_counter_clock_hz = counter_clock_hz == 0U ? 1U : counter_clock_hz;
  const auto target_frequency_hz = frequency_hz == 0U ? 1U : frequency_hz;
  const auto period_ticks =
      std::max<uint32_t>(target_counter_clock_hz / target_frequency_hz, 1U);
  return period_ticks - 1U;
}

opaque_adc make_opaque(const AdcId id) noexcept {
  const auto* const config = config_for(id);
  return config != nullptr ? make_opaque(config) : opaque_adc{};
}
}  // namespace

result Adc::start() noexcept {
  opaque_adc::start();
  return result::OK;
}

Adc::Adc(const AdcId id) noexcept : m_id(id), m_opaque(make_opaque(id)) {
}

result Adc::init() noexcept {
  return m_opaque.init();
}

result Adc::stop() noexcept {
  return m_opaque.stop();
}

expected::expected<uint16_t, result> Adc::read() noexcept {
  uint16_t value{0U};
  const auto status = m_opaque.read(value);
  if (status != result::OK) {
    return expected::unexpected(status);
  }

  return value;
}

expected::expected<std::optional<uint16_t>, result> Adc::try_read() noexcept {
  bool has_value{false};
  uint16_t value{0U};
  const auto status = m_opaque.try_read(has_value, value);
  if (status != result::OK) {
    return expected::unexpected(status);
  }

  if (!has_value) {
    return std::optional<uint16_t>{};
  }

  return std::optional<uint16_t>{value};
}

namespace {

std::size_t dma_transfer_length(const opaque_adc& config) noexcept {
  return config.dma_frame_count() == 0U ? 1U : config.dma_frame_count();
}

std::size_t dma_sequence_length(const opaque_adc& config) noexcept {
  const auto configured_length = config.dma_sequence_length();
  return configured_length == 0U ? 1U : configured_length;
}

std::size_t dma_window_width(const opaque_adc& config) noexcept {
  const auto configured_width = config.dma_window_width();
  return configured_width == 0U ? dma_transfer_length(config) : configured_width;
}

bool uses_fixed_window_average(const opaque_adc& config) noexcept {
  return config.dma_backend() == stm32h5xx::cfg::adc_dma_backend::fixed_window_average;
}

uint16_t* dma_buffer(const opaque_adc& runtime) noexcept {
  return dma_buffer_for(runtime.m_p_config);
}

opaque_adc*& dma_owner_slot(ADC_TypeDef* const p_instance) noexcept {
  static opaque_adc* adc1_owner{nullptr};
  static opaque_adc* adc2_owner{nullptr};
  static opaque_adc* invalid_owner{nullptr};

  switch (reinterpret_cast<uintptr_t>(p_instance)) {
    case ADC1_BASE:
      return adc1_owner;
    case ADC2_BASE:
      return adc2_owner;
    default:
      return invalid_owner;
  }
}

struct dma_shared_state {
  std::size_t processed_samples_in_cycle{0U};
  std::array<uint64_t, kAdcDmaMaxSequenceLength> average_sums{};
  std::array<uint32_t, kAdcDmaMaxSequenceLength> average_sample_counts{};
  uint64_t fixed_window_sum{0U};
  uint32_t fixed_window_count{0U};
};

dma_shared_state& dma_state_slot(ADC_TypeDef* const p_instance) noexcept {
  static dma_shared_state adc1_state{};
  static dma_shared_state adc2_state{};
  static dma_shared_state invalid_state{};

  switch (reinterpret_cast<uintptr_t>(p_instance)) {
    case ADC1_BASE:
      return adc1_state;
    case ADC2_BASE:
      return adc2_state;
    default:
      return invalid_state;
  }
}

opaque_adc* dma_owner_for_instance(ADC_TypeDef* const p_instance) noexcept {
  return p_instance != nullptr ? dma_owner_slot(p_instance) : nullptr;
}

