MicheleTesser/stm32h5_template_drivers/adc.cpp
void set_dma_owner(ADC_TypeDef* const p_instance, opaque_adc* const p_owner) noexcept {
  if (p_instance != nullptr) {
    dma_owner_slot(p_instance) = p_owner;
  }
}

bool dma_initialized(const opaque_adc& config) noexcept {
  return config.m_handle.Instance != nullptr && config.m_dma_channel_handle.Instance != nullptr;
}

opaque_adc* running_dma_owner_for(const opaque_adc& config) noexcept {
  if (!config.uses_dma()) {
    return nullptr;
  }

  auto* const owner = dma_owner_for_instance(config.instance());
  if (owner == nullptr || !dma_initialized(*owner)) {
    return nullptr;
  }

  return owner;
}

opaque_adc* adc_from_handle(ADC_HandleTypeDef* const hadc) noexcept {
  return hadc != nullptr ? dma_owner_for_instance(hadc->Instance) : nullptr;
}

dma_shared_state& dma_state(opaque_adc& runtime) noexcept {
  return dma_state_slot(runtime.instance());
}

void accumulate_dma_samples(opaque_adc& runtime, const std::size_t begin_sample,
                            const std::size_t end_sample) noexcept {
  const auto active_buffer_length = dma_transfer_length(runtime);
  if (active_buffer_length == 0U) {
    (void)begin_sample;
    (void)end_sample;
    return;
  }

  const std::size_t begin = std::min(begin_sample, active_buffer_length);
  const std::size_t end = std::min(end_sample, active_buffer_length);
  const auto sequence_length = dma_sequence_length(runtime);
  auto& state = dma_state(runtime);
  auto* const buffer = dma_buffer(runtime);

  for (std::size_t sample = begin; sample < end; ++sample) {
    const auto channel_index = sample % sequence_length;
    state.average_sums[channel_index] += buffer[sample];
    state.average_sample_counts[channel_index] += 1U;
  }
}

void accumulate_dma_until(opaque_adc& runtime, const std::size_t boundary) noexcept {
  auto& state = dma_state(runtime);
  if (boundary <= state.processed_samples_in_cycle) {
    return;
  }

  accumulate_dma_samples(runtime, state.processed_samples_in_cycle, boundary);
  state.processed_samples_in_cycle = boundary;
}

uint64_t sum_fixed_dma_window(const opaque_adc& runtime,
                              const std::size_t end_sample) noexcept {
  const auto active_buffer_length = dma_transfer_length(runtime);
  const auto window_width = dma_window_width(runtime);
  auto* const buffer = dma_buffer(runtime);
  uint64_t sum{0U};

  const auto sum_range = [buffer, &sum](const std::size_t begin,
                                        const std::size_t end) noexcept {
    for (std::size_t sample = begin; sample < end; ++sample) {
      sum += buffer[sample];
    }
  };

  if (window_width <= end_sample) {
    sum_range(end_sample - window_width, end_sample);
    return sum;
  }

  const auto wrapped_count = window_width - end_sample;
  sum_range(active_buffer_length - wrapped_count, active_buffer_length);
  sum_range(0U, end_sample);
  return sum;
}

void complete_fixed_dma_window(opaque_adc& runtime,
                               const std::size_t boundary) noexcept {
  const auto active_buffer_length = dma_transfer_length(runtime);
  auto& state = dma_state(runtime);
  if (active_buffer_length == 0U || boundary > active_buffer_length ||
      boundary <= state.processed_samples_in_cycle) {
    return;
  }

  const auto window_width = dma_window_width(runtime);
  const auto completed_count = boundary - state.processed_samples_in_cycle;
  const auto previous_valid_count = state.fixed_window_count & DMA_SAMPLE_COUNT_MASK;
  const auto valid_count =
      std::min<uint32_t>(static_cast<uint32_t>(window_width),
                         previous_valid_count + static_cast<uint32_t>(completed_count));

  state.processed_samples_in_cycle = boundary;
  if (valid_count < window_width) {
    state.fixed_window_count = valid_count;
    return;
  }

  state.fixed_window_sum = sum_fixed_dma_window(runtime, boundary);
  state.fixed_window_count = static_cast<uint32_t>(window_width) | DMA_FIXED_WINDOW_READY;
}

bool prepare_dma_runtime(opaque_adc& runtime) noexcept {
  auto& state = dma_state(runtime);
  state.average_sums.fill(0U);
  state.average_sample_counts.fill(0U);
  state.fixed_window_sum = 0U;
  state.fixed_window_count = 0U;
  state.processed_samples_in_cycle = 0U;
  const auto active_buffer_length = dma_transfer_length(runtime);
  const auto sequence_length = dma_sequence_length(runtime);
  const auto window_width = dma_window_width(runtime);
  return dma_buffer(runtime) != nullptr &&
         active_buffer_length <= dma_buffer_size_for(runtime.m_p_config) &&
         sequence_length > 0U && sequence_length <= kAdcDmaMaxSequenceLength &&
         (!uses_fixed_window_average(runtime) || sequence_length == 1U) &&
         window_width > 0U && window_width <= active_buffer_length &&
         window_width <= DMA_SAMPLE_COUNT_MASK;
}

bool configure_adc_channels(opaque_adc& runtime) noexcept {
  const auto sequence_length = dma_sequence_length(runtime);
  if (sequence_length == 1U) {
    auto channel_config = runtime.channel_init();
    channel_config.Rank = ADC_REGULAR_RANK_1;
    return HAL_ADC_ConfigChannel(&runtime.m_handle, &channel_config) == HAL_OK;
  }

  const auto* const channel_sequence = runtime.dma_channel_sequence();
  if (channel_sequence == nullptr) {
    return false;
  }

  for (std::size_t index = 0U; index < sequence_length; ++index) {
    auto channel_config = channel_sequence[index];
    if (HAL_ADC_ConfigChannel(&runtime.m_handle, &channel_config) != HAL_OK) {
      return false;
    }
  }

  return true;
}

bool init_trigger_timer(opaque_adc& runtime) noexcept {
  enable_tim_clock(runtime.trigger_timer_instance());

  auto& timer_handle = runtime.m_trigger_timer_handle;
  timer_handle = {};
  timer_handle.Instance = runtime.trigger_timer_instance();
  timer_handle.Init = runtime.trigger_timer_init();
  timer_handle.Init.Prescaler =
      timer_prescaler(runtime.trigger_timer_instance(), runtime.trigger_counter_clock_hz());
  timer_handle.Init.Period =
      timer_period(runtime.trigger_counter_clock_hz(), runtime.trigger_frequency_hz());

  if (HAL_TIM_Base_Init(&timer_handle) != HAL_OK) {
    timer_handle.Instance = nullptr;
    return false;
  }

  auto master_config = runtime.trigger_master_config();
  if (HAL_TIMEx_MasterConfigSynchronization(&timer_handle, &master_config) != HAL_OK) {
    (void)HAL_TIM_Base_DeInit(&timer_handle);
    timer_handle.Instance = nullptr;
    return false;
  }

  __HAL_TIM_SET_COUNTER(&timer_handle, 0U);
  return true;
}

bool start_trigger_timer(opaque_adc& runtime) noexcept {
  auto& timer_handle = runtime.m_trigger_timer_handle;
  if (timer_handle.Instance == nullptr) {
    return true;
  }

  return HAL_TIM_Base_Start(&timer_handle) == HAL_OK;
}

bool start_dma_backend_impl(opaque_adc& runtime) noexcept {
  if (!runtime.uses_dma()) {
    return false;
  }

  auto* const active_owner = dma_owner_for_instance(runtime.instance());
  if (active_owner != nullptr && active_owner != &runtime) {
    return false;
  }

  if (dma_initialized(runtime)) {
    return true;
  }

  const auto* const config = runtime.m_p_config;
  runtime = make_opaque(config);
  set_dma_owner(runtime.instance(), &runtime);

