MicheleTesser/stm32h5_template_drivers/adc.cpp
  const auto fail = [&runtime, config]() noexcept {
    set_dma_owner(runtime.instance(), nullptr);
    runtime = make_opaque(config);
    return false;
  };

  __HAL_RCC_ADC_CLK_ENABLE();
  __HAL_RCC_GPDMA1_CLK_ENABLE();

  if (!prepare_dma_runtime(runtime)) {
    return fail();
  }

  if (runtime.uses_timer_trigger() && !init_trigger_timer(runtime)) {
    return fail();
  }

  DMA_NodeConfTypeDef node_config{};
  node_config.NodeType = DMA_GPDMA_LINEAR_NODE;
  node_config.Init.Request = runtime.dma_request();
  node_config.Init.BlkHWRequest = DMA_BREQ_SINGLE_BURST;
  node_config.Init.Direction = DMA_PERIPH_TO_MEMORY;
  node_config.Init.SrcInc = DMA_SINC_FIXED;
  node_config.Init.DestInc = DMA_DINC_INCREMENTED;
  node_config.Init.SrcDataWidth = DMA_SRC_DATAWIDTH_HALFWORD;
  node_config.Init.DestDataWidth = DMA_DEST_DATAWIDTH_HALFWORD;
  node_config.Init.SrcBurstLength = 1U;
  node_config.Init.DestBurstLength = 1U;
  node_config.Init.TransferAllocatedPort =
      DMA_SRC_ALLOCATED_PORT0 | DMA_DEST_ALLOCATED_PORT0;
  node_config.Init.TransferEventMode = DMA_TCEM_BLOCK_TRANSFER;
  node_config.Init.Mode = DMA_NORMAL;
  node_config.TriggerConfig.TriggerPolarity = DMA_TRIG_POLARITY_MASKED;
  node_config.DataHandlingConfig.DataExchange = DMA_EXCHANGE_NONE;
  node_config.DataHandlingConfig.DataAlignment = DMA_DATA_RIGHTALIGN_ZEROPADDED;

  if (HAL_DMAEx_List_BuildNode(&node_config, &runtime.m_dma_node) != HAL_OK ||
      HAL_DMAEx_List_InsertNode(&runtime.m_dma_queue, nullptr, &runtime.m_dma_node) != HAL_OK ||
      HAL_DMAEx_List_SetCircularMode(&runtime.m_dma_queue) != HAL_OK) {
    return fail();
  }

  runtime.m_dma_channel_handle.Instance = runtime.dma_channel();
  runtime.m_dma_channel_handle.InitLinkedList.Priority = DMA_LOW_PRIORITY_LOW_WEIGHT;
  runtime.m_dma_channel_handle.InitLinkedList.LinkStepMode = DMA_LSM_FULL_EXECUTION;
  runtime.m_dma_channel_handle.InitLinkedList.LinkAllocatedPort = DMA_LINK_ALLOCATED_PORT0;
  runtime.m_dma_channel_handle.InitLinkedList.TransferEventMode = DMA_TCEM_BLOCK_TRANSFER;
  runtime.m_dma_channel_handle.InitLinkedList.LinkedListMode = DMA_LINKEDLIST_CIRCULAR;

  if (HAL_DMAEx_List_Init(&runtime.m_dma_channel_handle) != HAL_OK ||
      HAL_DMAEx_List_LinkQ(&runtime.m_dma_channel_handle, &runtime.m_dma_queue) != HAL_OK ||
      HAL_DMA_ConfigChannelAttributes(&runtime.m_dma_channel_handle, DMA_CHANNEL_NPRIV) !=
          HAL_OK) {
    return fail();
  }

  HAL_NVIC_SetPriority(runtime.dma_irq(), 6U, 0U);
  HAL_NVIC_EnableIRQ(runtime.dma_irq());

  runtime.m_handle.Instance = runtime.instance();
  runtime.m_handle.Init = runtime.adc_init();
  __HAL_LINKDMA(&runtime.m_handle, DMA_Handle, runtime.m_dma_channel_handle);

  if (HAL_ADC_Init(&runtime.m_handle) != HAL_OK) {
    return fail();
  }

  if (!configure_adc_channels(runtime)) {
    return fail();
  }

  auto* const buffer = dma_buffer(runtime);
  std::fill_n(buffer, dma_transfer_length(runtime), 0U);

  if (HAL_ADCEx_Calibration_Start(&runtime.m_handle, ADC_SINGLE_ENDED) != HAL_OK ||
      HAL_ADC_Start_DMA(&runtime.m_handle,
                        reinterpret_cast<uint32_t*>(buffer),
                        static_cast<uint32_t>(dma_transfer_length(runtime))) != HAL_OK) {
    return fail();
  }

  if (!start_trigger_timer(runtime)) {
    return fail();
  }

  return true;
}

uint32_t lock_irq() noexcept {
  const uint32_t primask = __get_PRIMASK();
  __disable_irq();
  return primask;
}

void unlock_irq(const uint32_t primask) noexcept {
  __set_PRIMASK(primask);
}

expected::expected<uint16_t, result> read_dma_average(const opaque_adc& config) noexcept {
  auto* const runtime = running_dma_owner_for(config);
  if (runtime == nullptr) {
    return expected::unexpected(result::RECOVERABLE_ERROR);
  }

  const auto channel_index = config.dma_sequence_index();
  if (channel_index >= dma_sequence_length(*runtime)) {
    return expected::unexpected(result::RECOVERABLE_ERROR);
  }

  auto& state = dma_state(*runtime);
  const uint32_t primask = lock_irq();
  const uint64_t sum = state.average_sums[channel_index];
  const uint32_t count = state.average_sample_counts[channel_index];
  state.average_sums[channel_index] = 0U;
  state.average_sample_counts[channel_index] = 0U;
  unlock_irq(primask);

  if (count == 0U) {
    return expected::unexpected(result::RECOVERABLE_ERROR);
  }

  return static_cast<uint16_t>(sum / count);
}

expected::expected<uint16_t, result> read_dma_fixed_window_average(
    const opaque_adc& config) noexcept {
  auto* const runtime = running_dma_owner_for(config);
  if (runtime == nullptr || runtime != &config) {
    return expected::unexpected(result::RECOVERABLE_ERROR);
  }

  const auto window_width = dma_window_width(*runtime);
  auto& state = dma_state(*runtime);
  const uint32_t primask = lock_irq();
  const uint64_t sum = state.fixed_window_sum;
  const uint32_t count = state.fixed_window_count;
  state.fixed_window_count = count & DMA_SAMPLE_COUNT_MASK;
  unlock_irq(primask);

  if ((count & DMA_FIXED_WINDOW_READY) == 0U) {
    return expected::unexpected(result::RECOVERABLE_ERROR);
  }

  return static_cast<uint16_t>(sum / window_width);
}

expected::expected<std::optional<uint16_t>, result> try_read_dma_average(
    const opaque_adc& config) noexcept {
  auto* const runtime = running_dma_owner_for(config);
  if (runtime == nullptr) {
    return expected::unexpected(result::RECOVERABLE_ERROR);
  }

  const auto channel_index = config.dma_sequence_index();
  if (channel_index >= dma_sequence_length(*runtime)) {
    return expected::unexpected(result::RECOVERABLE_ERROR);
  }

  auto& state = dma_state(*runtime);
  const uint32_t primask = lock_irq();
  const uint64_t sum = state.average_sums[channel_index];
  const uint32_t count = state.average_sample_counts[channel_index];
  state.average_sums[channel_index] = 0U;
  state.average_sample_counts[channel_index] = 0U;
  unlock_irq(primask);

  if (count == 0U) {
    return std::optional<uint16_t>{};
  }

  return std::optional<uint16_t>{static_cast<uint16_t>(sum / count)};
}

expected::expected<std::optional<uint16_t>, result> try_read_dma_fixed_window_average(
    const opaque_adc& config) noexcept {
  auto* const runtime = running_dma_owner_for(config);
  if (runtime == nullptr || runtime != &config) {
    return expected::unexpected(result::RECOVERABLE_ERROR);
  }

  const auto window_width = dma_window_width(*runtime);
  auto& state = dma_state(*runtime);
  const uint32_t primask = lock_irq();
  const uint64_t sum = state.fixed_window_sum;
  const uint32_t count = state.fixed_window_count;
  state.fixed_window_count = count & DMA_SAMPLE_COUNT_MASK;
  unlock_irq(primask);

  if ((count & DMA_FIXED_WINDOW_READY) == 0U) {
    return std::optional<uint16_t>{};
  }

  return std::optional<uint16_t>{static_cast<uint16_t>(sum / window_width)};
}
}  // namespace

